Tekla Open API Reference for Tekla Structures 2025
FacetedBrepFaceHole.VerticeIndexes Property
 Gets the vertice indexes.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<int> VerticeIndexes { get; }
Public ReadOnly Property VerticeIndexes As IList(Of Integer)
	Get
Property Value
Type: IList<Int32>
See Also
Reference
FacetedBrepFaceHole Class
Tekla.Structures.Geometry3d Namespace